// tdex用户类型
export const userType = {
  '1': '普通',
  '2': '内部',
  '3': '测试',
  '8': '机构'
}
// 合伙人类型
export const agentModeType = {
  '0': '普通',
  '1': '超级合伙人',
  '2': '合约人下线',
  '3': '盈链合伙人'
}
// 币种编号
export const currencyNumber = {
  '1': 'BTC',
  '2': 'ETH',
  '3': 'USDT',
  '4': 'EOS',
  '5': 'LTC',
  '6': 'XRP',
  '7': 'USD',
  '8': 'BNB',
  '9': 'TRX',
  '10': 'BCHABC',
  '11': 'TD',
  '12': 'TD-Freeze',
  '13': 'CRE',
  // '101': 'JPY',
  // '102': 'CAD',
  // '103': 'CHF',
  // '104': 'CNH',
  // '105': 'HKD',
  // '106': 'EUR',
  // '107': 'GBP',
  // '108': 'AUD',
  '109': 'USDT-ERC20',
}
// order 路由里面的订单状态
export const orderStatus = {
  '0': '0-未处理',
  '1': '1-已完成',
  '2': '2-已取消',
  '3': '3-处理中',
  '4': '4-等待确认',
  '5': '5-等待审核',
  '6': '6-异常',
  '7': '7-余额不足',
  '8': '8-正在更新',
  '9': '9-邮件确认中',
  '18': '18-等待自动执行',
}
// 钱包地址路径 币种 <-> 路径
export const addressPath = {
  '1': 'https://btc.com/',
  '2': 'https://etherscan.io/address/',
  '3': 'https://omniexplorer.info/address/',
  '4': 'https://eosflare.io/account/',
  '5': 'https://ltc.btc.com/address/',
  '6': 'https://xrpscan.com/account/',
  '7': 'https://www.omniexplorer.info/address/',
  '8': 'https://etherscan.io/address/',
  '9': 'https://tronscan.org/#/address/',
  '10': 'https://bch.btc.com/',
  '11': 'https://eosflare.io/account/',
  '13': 'https://etherscan.io/address/'
}
// order 路由 订单信息
export const orderActions = {
  '101': '101-委托',
  '102': '102-成交',
  '103': '103-手续费',
  '104': '104-撤单',
  '105': '105-转入',
  '106': '106-转出',
  '107': '107-抵扣',
  '1001': '1001-充值',
  '2001': '2001-提现',
  '2002': '2002-取消提现',
  '3001': '3001-划转-期货转现货',
  '3002': '3002-划转-现货转期货',
  '3003': '3003-划转-恢复划转',
  '3005': '3005-转账交易-出',
  '3006': '3006-转账交易-入',
  '4001': '4001-奖励-佣金分成',
  '4002': '4002-奖励-交易分成',
  '4003': '4003-奖励-推荐分成',
  '4004': '4004-奖励-注册赠送',
  '4005': '4005-奖励-优惠购买',
  '4006': '4006-奖励-申购',
  '4007': '4007-奖励-申购返还',
  '4008': '4008-奖励-申购佣金',
  '4009': '4009-奖励-充值赠送',
  '4010': '4010-奖励-解锁',
  '4011': '4011-奖励-模拟金',
  '5001': '5001-分发-分红',
  '5002': '5002-分发-挖矿',
  '5003': '5003-分发-佣金',
  '6001': '6001-兑换',
  '6002': '6002-申购',
  '6003': '6003-申购返还',
  '7001': '7001-解锁-分发',
  '7002': '7002-解锁-回收',
  '8001': '8001-转账-游戏转入到平台',
  '8002': '8002-转账-平台转出到游戏',
  '8003': '8003-转账-转出',
  '8004': '8004-转账-转入',
  '8005': '8005-转账-交易-出',
  '8006': '8006-转账-交易-入',
  '9001': '9001-注册赠送',
  '9002': '9002-系统调整',
  '9003': '9003-邀请赠送',
  '9004': '9004-测试资金',
  '9005': '9005-其他-提现完成',
  '9101': '9101-媒体空投',
  '9102': '9102-微博空投',
  '9103': '9103-电报空投',
  '9104': '9104-微信空投',
  '9105': '9105-QQ空投',
  '9106': '9106-公众号空投',
  '9200': '9200-基石投放',
  '9300': '9300-BUG奖励',
  '9400': '9400-活动奖励'
}

export const orderType = {
  '1': '1-充值',
  '2': '2-提现',
  '8': '8-转账',
  '4': '4-活动',
  '5': '5-挖矿',
  '6': '6-兑换',
  '7': '7-解锁',
  '3': '3-期现互转',
  '9': '9-其它'
}

// 期货状态
export const futuresState = {
  '0': '0-未触发',
  '1': '1-等待触发',
  '2': '2-未成交',
  '3': '3-执行中',
  '4': '4-已撤销',
  '5': '5-已完成'
}

// 现货状态
export const spotState = {
  // APPLY 申请 0
  '0': '0-申请',
  // CREATED 创建 1
  '1': '1-创建',
  // SUBMITED 提交 2
  '2': '2-提交',
  // EXECUTED 执行 3
  '3': '3-执行',
  // CANCELED 取消 4
  '4': '4-取消',
  // DISBANDED 撤销 5
  '5': '5-撤销',
  // FINISHED 完成 6
  '6': '6-完成',
  // CLOSED 关闭 7
  '7': '7-关闭',
  // SOMEDEAL 部分成交 8
  '8': '8-部分成交',
  // ALLDEAL 全部成交 9
  '9': '9-全部成交'
}

// 公告类型
export const noticeType = {
  '1': '普通',
  '2': '弹框'
}

// 管理员操作常量
export const adminAction = {
  '1001': '修改权限',
  '1002': '删除权限',
  '1004': '删除权限组',
  '1005': '设置权限组',
  '1006': '修改密码',
  '1007': '创建管理员',
  '1008': '提现',
  '1009': '删除权限组',
  '2001': '增加币',
  '2002': '减币',
  '2003': '用户改密',
  '2004': '改变用户类型',
  '2005': '解绑',
  '2006': '冻结'
}

// 权限模块解析
export const modulesMap = {
  admin: '后台管理',
  adminAccount: '管理账号',
  adminAccess: '权限设置',
  adminLog: '管理日志',
  user: '用户管理',
  userList: '用户列表',
  userNexus: '用户关系',
  userOnline: '在线用户',
  userLogs: '用户日志',
  userOTCIdent: '实名验证',
  futures: '永续交易',
  futuresPosition: '持仓管理',
  futuresOrder: '挂单列表',
  futuresHistory: '历史查询',
  historyPosition: '爆仓列表',
  cfd: '差价交易',
  cfdHistoryPosition: '仓位历史',
  cfdPosition: '仓位',
  cfdOrder: '委托',
  cfdHistory: '委托历史',
  walletLog: '钱包列表',
  stock: '现货交易',
  stockBuy: '买单',
  stockSell: '卖单',
  counts: '统计报表',
  countsActive: '活跃统计',
  countsUser: '活跃用户',
  countsSilent: '沉默用户',
  countsLoss: '流失用户',
  countsUsdt: 'USDT统计',
  order: '订单管理',
  orderPay: '充值订单',
  orderPut: '提现管理',
  orderAddress: '地址管理',
  orderTransfer: '转账订单',
  orderActivity: '活动订单',
  orderOther: '其它订单',
  orderlist: '所有订单',
  operates: '运营管理',
  notice: '公告管理',
  advert: '活动管理',
  banner: '广告管理',
  luckHistory: '中奖历史',
  mine: '挖矿管理',
  mineRecord: '挖矿记录',
  statistical: '统计报表',
  reportBalance: '余额统计',
  reportMoney: '资金统计',
  reportStatTd: 'TD监控',
  reportUser: '用户统计',
  reportNexus: '用户关系',
  balance: '余额统计',
  money: '资金统计',
  stattd: 'TD监控',
  user: '用户统计',
  message: '发送信息',
  email: '发送邮件',
  msg: '发送短信',
  spot: '币币交易',
  capitalRecord: '资金记录',
  crSpot: '币币资金',
  crReverse: '合约资金',
  crCfd: '差价资金',
  coinApply: '申购记录',
  spotOrders: '现货当前委托列表',
  spotHistory: '现货委托历史查询',
  spotDetails: '现货成交历史查询',
  superHome: '超级经纪人首页',
  superUserManage: '超级用户管理',
  superCommercialManage: '超级商户管理',
  ship: '用户关系',
  superUser: '用户列表',
  commercial: '普通用户提成报表',
  superCommercial: '超级经纪人提成报表',
  GetIdentList: '获取OTC用户关系',
  SearchIdentList: '搜索OTC用户关系',
  UnbindIdent: '取消身份验证',
  cfdMonitor:'CFD后台监控',
  cfdMonitorAccount:'用户差价账户',
  cfdMonitorStatistics:'差价产品盈亏统计',
  cfdMonitorHedge:'对冲监控',
  cfdMonitorRank:'盈亏排行榜',
  cfdMonitorStatisticsWeek:'差价产品盈亏周统计',
  otcsell:'OTC提现',
}

// 流水类型
export const flowWater = {
  '9002': '9002-系统调整',
  '9004': '9004-测试资金',
  '9101': '9101-媒体空投',
  '9102': '9102-微博空投',
  '9103': '9103-电报空投',
  '9104': '9104-微信空投',
  '9105': '9105-QQ空投',
  '9106': '9106-公众号空投',
  '9200': '9200-基石投放',
  '9300': '9300-BUG奖励',
  '9400': '9400-活动奖励',
  '9500': '9500-招募奖励'
}

// 用户日记操作指令
export const userLogsCmd = {
  '65537': '登录',
  '65538': '注册',
  '65539': '密码',
  '65540': '账号信息',
  '65541': '注销登录',
  '65542': '身份认证',
  '65543': '登录日志',
  '65544': '手机绑定',
  '65545': '谷歌验证绑定',
  '65546': '客户端配置',
  '65547': '设置语言',
  '65548': '激活',
  '65549': '更新令牌',
  '65550': '找回密码',
  '65551': '奖励记录',
  '65552': 'API管理',
  '69633': '设备注册',
  '73729': '发送手机验证码',
  '73730': '二次验证',
  '131073': '所有余额',
  '131074': '单个余额',
  '131075': '订单历史',
  '131076': '地址',
  '131077': '提现',
  '131078': '发放记录',
  '200705': '获取推荐信息',
  '200706': '已邀请列表',
  '200707': '邀请奖励',
  '200708': '发送邀请邮件',
  '200709': '检查Token',
  '270337': '活动列表',
  '270338': '完成任务',
  '270339': '放弃任务',
  '270340': '活动详情',
  '270593': '申购',
  '270594': '申购历史',
  '331777': '新闻列表',
  '331778': '查看新闻',
  '335873': '站内信列表',
  '335874': '设置已读',
  '335875': '删除站内信',
  '393217': '服务器时间',
  '393218': '服务器版本号',
  '393219': 'ping',
  '393220': '系统设置',
  '458753': '支付请求',
  '458754': 'Nsq事件',
  '458755': '设置图形验证码',
  '458756': '设置标记价',
  '458757': '资产费率',
  '524289': '买',
  '524290': '卖',
  '524291': '取消',
  '524292': '订单列表',
  '524293': '历史记录',
  '589825': '开仓',
  '589826': '平仓',
  '589827': '取消',
  '589828': '替换',
  '589829': '设置止损',
  '589830': '设置止盈',
  '589831': '合仓',
  '589832': '分仓',
  '589833': '修改',
  '589834': '选项设置',
  '589837': '订单',
  '589838': '历史',
  '589839': '持仓',
  '589840': '全部平仓',
  '655361': '游戏登录',
  '655362': '存款入平台',
  '655363': '同步余额到平台',
  '659457': '拍卖品列表',
  '659458': '拍卖出价',
  '659459': '拍卖记录',
  '659460': '转账到游戏',
  '659461': '账号信息',
  '659462': '用户余额',
  '659463': '游戏余额',
  '659464': '游戏余额',
  '659465': '游戏列表',
  '720897': '虚拟币列表'
}

//处理器
export const handler = {
  '0': '未知',
  '1': '人工',
  '2': '自动'
}

//通知状态
export const notify = {
  '0': '未通知',
  '1': '待通知',
  '2': '已通知'
}

//支付状态
export const payStatus = {
  '0': '0-未处理',
  '1': '1-已完成',
  '2': '2-已取消',
  '3': '3-处理中'
}
//1-111 TD, 2-666 TD, 3-888 TD, 4-iPad, 5-iPHone XR, 6-0.1 BTC
export const luckDraw = {
  '1': '111 TD',
  '2': '666 TD',
  '3': '888 TD',
  '4': 'iPad',
  '5': 'iPHone XR',
  '6': '0.1 BTC'
}

export const bugUid = {
  '21332': '1',
  '782413': '1',
  '782784': '1',
  '1019296': '1',
  '1019954': '1',
  '2824924': '1',
  '3048005': '1',
  '4481460': '1',
  '6128984': '1',
  '6588038': '1',
  '6588454': '1',
  '6613108': '1',
  '6613833': '1',
  '7018229': '1',
  '7018452': '1',
  '7020041': '1',
  '7882535': '1',
  '7882789': '1',
  '8814155': '1',
  '8814969': '1',
  '9039046': '1',
  '9039180': '1',
  '9039264': '1',
  '9039977': '1'
}

export const addresslabel = {
  '0': '未使用',
  '1': '已使用',
}

export const errstatus = {
  '1000': '未知产品',
  '1001': '参数错误',
  '1002': '未知订单',
  '1003': '已设置（止损|止盈|平仓），可以修改或取消',
  '1004': '条件会被立即触发',
  '1005': '已爆仓',
  '1006': '未知仓位',
  '1007': '全仓|逐仓模式不一致',
  '1008': '设置全仓|逐仓模式时,还有仓位或订单',
  '1009': '不支持的模式',
  '1010': '余额不足',
  '1011': '不能低于维持保证金',
  '1012': '全仓模式不能追加保证金',
  '1013': '只有开仓订单能设置杠杆',
  '1014': '只有开仓订单能设置数量',
  '1015': '数量不能小于等于已成交量',
  '1016': '已触发订单不能调整相关属性',
  '1017': '已激活订单不能设置触发相对性',
  '1018': '超出订单数量上限',
  '1019': '无条件市价开仓订单关联的止损止盈订单只能是价距',
  '1020': '不支持的功能',
  '1021': '产品休市',
  '1022': '系统忙',
  '1023': '忽略',
  '1024': '被动单尝试以taker身份成交',
  '1025': '市场没有可见的买一卖一单',
  '1026': '合并后将导致爆仓',
  '1027': '开仓订单数量超出系统限额{Limit}',
  '1028': '拆分失败，请先撤销已有的委托',
  '1029': '非法保证金数值，当前数值将导致杠杆超过{Scale}倍',
  '1030': '至少须要保留{Margin}保证金',
  '1031': '调整后将直接导致爆仓',
  '1032': '全仓模式下不能修改强平价',
  '1033': '全仓模式默认{Scale}倍杠杆',
  '1034': '订单强平风险高，已自动撤单',
  '1035': '平仓限价将会导致破产',
  '1036': '强平价不能超过警戒值{Force}',
  '1037': '合并后超过最大仓位限制{Limit}',
  '1038': '合并的仓位中包含不同币种的手续费，不支持合并',
  '1039': '修改后将导致实质暴仓',
  '1040': '合并后将导致破产',
  '2000': '市价单没有对手',
  '2001': '被动单以taker身份成交',
  '2002': '用户操作',
  '2003': '合并订单',
  '2004': '爆仓',
  '2005': '关联性',
  '2006': '拆单',
  '2007': '成交',
  '2008': '修改仓位杠杆',
  '2009': '设置仓位止损止盈',
  '2010': '修改订单',
  '2011': '过期',
  '2012': '订单触发，进入市场',
  '2013': '超时',
  '2014': '自动减仓',
  '2015': '爆仓后没有基金丢弃仓位',
  '2016': '收取资金费用',
  '2017': '后续有委托触发，被替换',
  '2018': '充值',
  '2019': '提现',
  '2020': '达到单笔最大成交量,撤单',
  '2021': '已实现盈亏',
  '2022': '实现手续费',
  '2023': '交割',
  '2024': '调整合约参数',
  '2025': '清理保证金残留',
  '2026': '后台维护',
  '2027': '收取隔夜费'
}


export const putHandler = {
  "0": "未知",
  "1": "人工",
  "2": "自动",
}
export const historyState = {
  "0": "等待中",
  "1": "已触发",
  "2": "已撤销",
  "3": "已成交",
  "4": "已关闭",
  "5": "排队"
}

export const historyAction = {
  "0": "止盈",
  "1": "止损",
  "2": "平仓",
  "3": "开仓",
  "4": "强平",
  "5": "自动减仓",
  "6": "拆分",
  "7": "合并",
}

export const cfdHistoryAction = {
  "0": "创建",
  "1": "等待中",
  "2": "已触发",
  "3": "已撤销",
  "4": "已成交",
  "5": "已关闭",
  "6": "排队",
  // "7": "合并",
}

export const cfdHistoryState = {
  "trade.order.State0": "未触发",
  "trade.order.State1": "等待触发",
  "trade.order.State1_tp": "已创建",
  "trade.order.State2": "未成交",
  "trade.order.State3": "执行中",
  "trade.order.State4": "已撤销",
  "trade.order.State5": "已完成",
  "trade.order.State6": "排队中",
  "trade.order.StatePart": "部分成交",
  "trade.order.StateCancel": "被撤销",
  "trade.order.StateModify": "修改",
  "trade.order.StateExpireCancel": "过期撤单",
  "trade.order.Strategy00": "市价",
  "trade.order.Strategy10": "限价",
  "trade.order.Strategy10_p": "限价被动",
  "trade.order.Strategy01": "止损市价",
  "trade.order.Strategy11": "止损限价",
  "trade.order.Strategy11_p": "止损限价被动",
  "trade.order.Strategy02": "追踪市价",
  "trade.order.Strategy12": "追踪限价",
}
export const historyType = {
  "trade.order.Type0": "市价",
  "trade.order.Type1": "限价",
  "trade.order.Type2": "条件(最新)",
  "trade.order.Type3": "条件(标记)",
  "trade.order.Type4": "止盈",
  "trade.order.Type5": "止损",
  "trade.order.Type6": "追踪止损",
  "trade.order.Type7": "限价被动",
  "trade.order.Type8": "限价隐藏",
  "trade.order.Type9": "爆仓",
}

export const historyCONST = {
  FUT: {
    Side: {
      BUY: 0, // 买
      SELL: 1, // 卖
    },
    Strategy: {
      // Immediate 直接下单
      Immediate: 0,
      // Line >=x || x<=
      Line: 1,
      // Trail 追踪
      Trail: 2
    },
    Variable: {
      // 最新价
      LastPrice: 0,
      // 标记价
      MarkPrice: 1,
      // 买一价
      BidPrice: 2,
      // 卖一价
      AskPrice: 3,
    },
    // 市价|限价
    Kind: {
      // 市价
      MKT: 0,
      // 限价
      LMT: 1,
    },
    // 指令
    Action: {
      // 止盈
      TP: 0,
      // 止损
      SL: 1,
      // 平仓
      CLOSE: 2,
      // 开仓
      OPEN: 3,
      // 清算(爆仓处理)
      CLEAR: 4,
      ADL: 5, // 自动减仓
      // 订单历史加入指令:
      Splited: 6, // 拆分
      Merged: 7, // 合并
    },
    // 时效性
    Timely: {
      // 一直有效
      GTC: 0,
      // 触发之后N分钟
      LIFE: 1,
      // 截止时间
      DEADLINE: 2,
    },
    Target: {
      ORDER: 0,
      POSITION: 1
    },
    // 订单状态
    State: {
      // 已创建
      CREATED: 0,
      // 等待触发
      WAITING: 1,
      // 已触发
      TRIGGERRED: 2,
      // 执行中
      EXECUTING: 3,
      // 已撤销
      CANCELED: 4,
      // 已完成
      FILLED: 5,
      //队列中
      QUEUE: 6
    }
  }
}


export const historyOperate = {
  "1": "市价平仓",
  "2": "限价平仓",
  "3": "止盈平仓",
  "4": "止损平仓",
  "5": "追踪止损平仓",
  "6": "强制平仓",
  "7": "自动减仓",
  "8": "合并仓位",
  "9": "拆分仓位",
  "10": "交割",
}